{
  "actor_profile": {
    "name": "Tyrone Power",
    "year_born": 1914,
    "year_died": 1958,
    "imdb_url": "https://www.imdb.com/name/nm0000061/",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Tyrone_Power_in_The_Mark_of_Zorro_trailer.jpg",
    "year_of_first_film": 1932,
    "year_of_last_film": 1957,
    "number_of_feature_films_made": 48,
    "actor_awards": {
      "oscars_won": 0,
      "oscars_nominated": 0,
      "walk_of_fame_stars": 1,
      "notes": "Power never received an Academy Award nomination, a fact often cited as a major oversight given his performances in films like 'Nightmare Alley' and 'Witness for the Prosecution'. He received a Star on the Hollywood Walk of Fame at 6747 Hollywood Blvd. He placed his hand and footprints in cement at Grauman's Chinese Theatre in 1937."
    }
  },
  "filmography": [
    {
      "title": "The Mark of Zorro",
      "year": 1940,
      "role": "Don Diego Vega / Zorro",
      "role_description": "A Spanish aristocrat who adopts the foppish persona of a dandy by day to conceal his identity as the masked vigilante Zorro, defender of the poor.",
      "plot": "A young aristocrat in 19th-century California masquerades as an effete fop to deceive the corrupt alcalde while secretly fighting injustice as a masked swordsman.",
      "awards": "National Film Registry: Inducted (2009); Oscar: Nominated – Best Original Score; AFI: 100 Years... 100 Heroes & Villains (Nominated)",
      "ratings": {
        "imdb": 7.5,
        "rotten_tomatoes_critic": 92,
        "rotten_tomatoes_popcorn": 86
      },
      "imdb_url": "https://www.imdb.com/title/tt0032764/"
    },
    {
      "title": "Nightmare Alley",
      "year": 1947,
      "role": "Stanton 'Stan' Carlisle",
      "role_description": "A charismatic but amoral carnival barker who ruthlessly manipulates everyone around him to rise from a sideshow mentalist to a high-society spiritualist.",
      "plot": "An ambitious con man learns a mind-reading code from a carnival mentalist and uses it to fleece the wealthy, leading to his own tragic downfall.",
      "awards": "None (Now considered a Film Noir classic)",
      "ratings": {
        "imdb": 7.7,
        "rotten_tomatoes_critic": 88,
        "rotten_tomatoes_popcorn": 87
      },
      "imdb_url": "https://www.imdb.com/title/tt0039661/"
    },
    {
      "title": "Witness for the Prosecution",
      "year": 1957,
      "role": "Leonard Vole",
      "role_description": "A charming, seemingly naive inventor accused of murdering a wealthy widow, who relies on his barrister to save him from the gallows.",
      "plot": "A veteran British barrister defends a man accused of murder, but the trial takes a shocking turn when the accused's wife testifies for the prosecution.",
      "awards": "AFI: 10 Top 10 (#6 Courtroom Drama); Oscar: Nominated – Best Picture, Best Director, Best Actor (Charles Laughton), Best Supporting Actress (Elsa Lanchester)",
      "ratings": {
        "imdb": 8.4,
        "rotten_tomatoes_critic": 100,
        "rotten_tomatoes_popcorn": 95
      },
      "imdb_url": "https://www.imdb.com/title/tt0051201/"
    },
    {
      "title": "The Razor's Edge",
      "year": 1946,
      "role": "Larry Darrell",
      "role_description": "A traumatized WWI pilot who rejects his wealthy fiancée and privileged life to travel the world in search of spiritual enlightenment.",
      "plot": "An American pilot returns from World War I seeking the meaning of life, rejecting the materialist world of his socialite fiancée.",
      "awards": "Oscar: Win – Best Supporting Actress (Anne Baxter); Nominated – Best Picture, Best Supporting Actor (Clifton Webb)",
      "ratings": {
        "imdb": 7.4,
        "rotten_tomatoes_critic": 83,
        "rotten_tomatoes_popcorn": 84
      },
      "imdb_url": "https://www.imdb.com/title/tt0038873/"
    },
    {
      "title": "Blood and Sand",
      "year": 1941,
      "role": "Juan Gallardo",
      "role_description": "A poor illiterate boy who rises to become Spain's greatest matador, only to be torn between his faithful wife and a seductive aristocrat.",
      "plot": "A naive bullfighter rises to fame and fortune but falls into a destructive affair with a beautiful socialite that threatens his marriage and career.",
      "awards": "Oscar: Win – Best Cinematography (Color); Nominated – Best Art Direction",
      "ratings": {
        "imdb": 6.9,
        "rotten_tomatoes_critic": 80,
        "rotten_tomatoes_popcorn": 67
      },
      "imdb_url": "https://www.imdb.com/title/tt0033405/"
    },
    {
      "title": "The Black Swan",
      "year": 1942,
      "role": "Jamie Waring",
      "role_description": "A dashing pirate who is pardoned and recruited by the new governor of Jamaica to help hunt down his former renegade allies.",
      "plot": "A reformed pirate helps the new governor of Jamaica rid the Caribbean of the notorious buccaneers who refuse to give up their trade.",
      "awards": "Oscar: Win – Best Cinematography (Color); Nominated – Best Special Effects, Best Music",
      "ratings": {
        "imdb": 6.8,
        "rotten_tomatoes_critic": 80,
        "rotten_tomatoes_popcorn": 65
      },
      "imdb_url": "https://www.imdb.com/title/tt0034522/"
    },
    {
      "title": "Jesse James",
      "year": 1939,
      "role": "Jesse James",
      "role_description": "A Missouri farmer who turns to banditry after railroad agents kill his mother, becoming a legendary folk hero and outlaw.",
      "plot": "After railroad agents kill their mother and steal their land, brothers Frank and Jesse James turn to bank robbery to exact revenge.",
      "awards": "Oscar: Nominated – Best Cinematography (Color); Box office hit of 1939",
      "ratings": {
        "imdb": 7.0,
        "rotten_tomatoes_critic": 83,
        "rotten_tomatoes_popcorn": 60
      },
      "imdb_url": "https://www.imdb.com/title/tt0031511/"
    },
    {
      "title": "Marie Antoinette",
      "year": 1938,
      "role": "Count Axel de Fersen",
      "role_description": "A Swedish nobleman who becomes the devoted lover and loyal champion of the doomed French Queen Marie Antoinette.",
      "plot": "The tragic life of Austrian Princess Marie Antoinette who becomes the Queen of France and meets her fate during the French Revolution.",
      "awards": "Oscar: Nominated – Best Actress (Norma Shearer), Best Supporting Actor (Robert Morley), Best Art Direction, Best Music",
      "ratings": {
        "imdb": 7.3,
        "rotten_tomatoes_critic": 73,
        "rotten_tomatoes_popcorn": 77
      },
      "imdb_url": "https://www.imdb.com/title/tt0030418/"
    },
    {
      "title": "Captain from Castile",
      "year": 1947,
      "role": "Pedro De Vargas",
      "role_description": "A Spanish nobleman fleeing the Inquisition who joins Hernán Cortés on his expedition to conquer Mexico.",
      "plot": "A young Spanish officer is forced to flee his homeland during the Inquisition and joins the expedition of Cortez to the New World.",
      "awards": "Oscar: Nominated – Best Music (Score)",
      "ratings": {
        "imdb": 6.9,
        "rotten_tomatoes_critic": 60,
        "rotten_tomatoes_popcorn": 55
      },
      "imdb_url": "https://www.imdb.com/title/tt0039243/"
    },
    {
      "title": "Prince of Foxes",
      "year": 1949,
      "role": "Andrea Orsini",
      "role_description": "A cunning courtier and assassin for Cesare Borgia who experiences a moral awakening while on a mission to conquer a city-state.",
      "plot": "A treacherous Renaissance nobleman is sent by Cesare Borgia to infiltrate a rival city but finds his conscience tested by the city's ruler.",
      "awards": "Oscar: Nominated – Best Cinematography (B&W), Best Costume Design",
      "ratings": {
        "imdb": 7.1,
        "rotten_tomatoes_critic": 60,
        "rotten_tomatoes_popcorn": 60
      },
      "imdb_url": "https://www.imdb.com/title/tt0041767/"
    },
    {
      "title": "The Long Gray Line",
      "year": 1955,
      "role": "Martin 'Marty' Maher",
      "role_description": "An Irish immigrant who spends 50 years at West Point, rising from a dishwasher to a beloved athletic trainer and NCO.",
      "plot": "The biographical story of Marty Maher, who came to West Point as a waiter and stayed for fifty years, becoming a friend and mentor to generations of cadets.",
      "awards": "None",
      "ratings": {
        "imdb": 7.3,
        "rotten_tomatoes_critic": 80,
        "rotten_tomatoes_popcorn": 78
      },
      "imdb_url": "https://www.imdb.com/title/tt0048312/"
    },
    {
      "title": "In Old Chicago",
      "year": 1938,
      "role": "Dion O'Leary",
      "role_description": "A charming, ambitious gambler and saloon owner in 1870s Chicago whose rivalry with his brother plays out against the Great Fire.",
      "plot": "Two brothers, one a rogue gambler and the other a reform-minded lawyer, clash in 1871 Chicago leading up to the Great Fire.",
      "awards": "Oscar: Win – Best Supporting Actress (Alice Brady), Best Assistant Director; Nominated – Best Picture",
      "ratings": {
        "imdb": 6.7,
        "rotten_tomatoes_critic": 71,
        "rotten_tomatoes_popcorn": 46
      },
      "imdb_url": "https://www.imdb.com/title/tt0030271/"
    },
    {
      "title": "Alexander's Ragtime Band",
      "year": 1938,
      "role": "Roger Grant / Alexander",
      "role_description": "A classical violinist who rebels against his family to lead a jazz band, spanning decades of American music history.",
      "plot": "A society boy scandalizes his family by pursuing a career in ragtime instead of serious music, leading a band through the decades.",
      "awards": "Oscar: Win – Best Music (Scoring); Nominated – Best Picture, Best Story, Best Original Song",
      "ratings": {
        "imdb": 6.9,
        "rotten_tomatoes_critic": 86,
        "rotten_tomatoes_popcorn": 52
      },
      "imdb_url": "https://www.imdb.com/title/tt0029852/"
    },
    {
      "title": "A Yank in the R.A.F.",
      "year": 1941,
      "role": "Tim Baker",
      "role_description": "A cocky American pilot who ferries a bomber to England for the money but ends up joining the Royal Air Force to impress an old flame.",
      "plot": "An American pilot joins the R.A.F. during the early days of WWII to be near his girlfriend, eventually participating in the Dunkirk evacuation.",
      "awards": "Oscar: Nominated – Best Special Effects",
      "ratings": {
        "imdb": 6.3,
        "rotten_tomatoes_critic": 50,
        "rotten_tomatoes_popcorn": 38
      },
      "imdb_url": "https://www.imdb.com/title/tt0034370/"
    },
    {
      "title": "The Black Rose",
      "year": 1950,
      "role": "Walter of Gurnie",
      "role_description": "A Saxon nobleman who leaves Norman-ruled England to seek his fortune in the Far East, encountering Mongol warlords.",
      "plot": "A 13th-century Saxon nobleman travels to China to find his fortune and becomes involved with a Mongol warlord and a beautiful English woman.",
      "awards": "Oscar: Nominated – Best Costume Design",
      "ratings": {
        "imdb": 6.3,
        "rotten_tomatoes_critic": 40,
        "rotten_tomatoes_popcorn": 38
      },
      "imdb_url": "https://www.imdb.com/title/tt0042256/"
    },
    {
      "title": "The Sun Also Rises",
      "year": 1957,
      "role": "Jake Barnes",
      "role_description": "An American journalist in post-WWI Paris who suffers from impotence due to a war wound, complicating his love for Lady Brett Ashley.",
      "plot": "A group of disillusioned American expatriate writers live a dissolute lifestyle in 1920s France and Spain, centered on the running of the bulls in Pamplona.",
      "awards": "None",
      "ratings": {
        "imdb": 6.3,
        "rotten_tomatoes_critic": 60,
        "rotten_tomatoes_popcorn": 39
      },
      "imdb_url": "https://www.imdb.com/title/tt0051032/"
    },
    {
      "title": "The Rains Came",
      "year": 1939,
      "role": "Major Rama Safti",
      "role_description": "A high-caste Indian doctor who dedicates his life to his people but is tempted by a forbidden romance with a married Englishwoman.",
      "plot": "In India, a dedicated doctor falls for a scandalous Englishwoman, but their romance is interrupted by a devastating earthquake and flood.",
      "awards": "Oscar: Win – Best Special Effects; Nominated – Best Cinematography, Best Art Direction, Best Sound, Best Editing",
      "ratings": {
        "imdb": 7.0,
        "rotten_tomatoes_critic": 83,
        "rotten_tomatoes_popcorn": 57
      },
      "imdb_url": "https://www.imdb.com/title/tt0031831/"
    },
    {
      "title": "Brigham Young",
      "year": 1940,
      "role": "Jonathan Kent",
      "role_description": "A fictional Mormon follower who serves as a romantic lead and audience surrogate during the arduous trek to Utah.",
      "plot": "The story of Brigham Young leading the Mormons across the American West to Salt Lake City after the death of Joseph Smith.",
      "awards": "None",
      "ratings": {
        "imdb": 6.3,
        "rotten_tomatoes_critic": 60,
        "rotten_tomatoes_popcorn": 40
      },
      "imdb_url": "https://www.imdb.com/title/tt0032281/"
    },
    {
      "title": "Johnny Apollo",
      "year": 1940,
      "role": "Bob Cain Jr. / Johnny Apollo",
      "role_description": "A college student who turns to a life of crime under an alias to pay for his embezzler father's release from prison.",
      "plot": "A son turns to crime to help his father, a convicted embezzler, but finds himself getting in too deep with the mob.",
      "awards": "None",
      "ratings": {
        "imdb": 6.9,
        "rotten_tomatoes_critic": 80,
        "rotten_tomatoes_popcorn": 57
      },
      "imdb_url": "https://www.imdb.com/title/tt0032657/"
    },
    {
      "title": "Son of Fury: The Story of Benjamin Blake",
      "year": 1942,
      "role": "Benjamin Blake",
      "role_description": "A wronged nobleman who flees to the South Seas to make his fortune diving for pearls and returns to England to claim his birthright.",
      "plot": "The illegitimate son of a nobleman fights for his inheritance against his scheming uncle, traveling to the South Seas to make his fortune.",
      "awards": "None",
      "ratings": {
        "imdb": 7.0,
        "rotten_tomatoes_critic": 80,
        "rotten_tomatoes_popcorn": 68
      },
      "imdb_url": "https://www.imdb.com/title/tt0035359/"
    },
    {
      "title": "This Above All",
      "year": 1942,
      "role": "Clive Briggs",
      "role_description": "A disillusioned British soldier who deserts the army after Dunkirk but finds his courage restored through the love of an aristocratic woman.",
      "plot": "During WWII, a wealthy young woman joins the WAAF and falls in love with a disillusioned deserter, urging him to return to duty.",
      "awards": "Oscar: Win – Best Art Direction; Nominated – Best Cinematography, Best Sound, Best Editing",
      "ratings": {
        "imdb": 7.0,
        "rotten_tomatoes_critic": 71,
        "rotten_tomatoes_popcorn": 60
      },
      "imdb_url": "https://www.imdb.com/title/tt0035433/"
    },
    {
      "title": "Rawhide",
      "year": 1951,
      "role": "Tom Owens",
      "role_description": "A civilized station master's assistant who is held hostage by four desperate escaped convicts at a remote stagecoach stop.",
      "plot": "An escaped convict and his gang take over a remote way station, holding a young man and a woman hostage while they wait to rob a gold shipment.",
      "awards": "None",
      "ratings": {
        "imdb": 7.0,
        "rotten_tomatoes_critic": 100,
        "rotten_tomatoes_popcorn": 62
      },
      "imdb_url": "https://www.imdb.com/title/tt0043961/"
    },
    {
      "title": "Crash Dive",
      "year": 1943,
      "role": "Lt. Ward Stewart",
      "role_description": "A PT boat commander who is transferred to a submarine and unknowingly falls for his commanding officer's fiancée.",
      "plot": "A submarine lieutenant and his commander vie for the same woman against a backdrop of commando raids on Nazi bases.",
      "awards": "Oscar: Win – Best Special Effects",
      "ratings": {
        "imdb": 6.3,
        "rotten_tomatoes_critic": 50,
        "rotten_tomatoes_popcorn": 45
      },
      "imdb_url": "https://www.imdb.com/title/tt0035763/"
    },
    {
      "title": "Abandon Ship!",
      "year": 1957,
      "role": "Alec Holmes",
      "role_description": "An executive officer who is forced to make agonizing life-and-death decisions when he takes command of an overcrowded lifeboat.",
      "plot": "After a luxury liner sinks, the officer in charge of an overloaded lifeboat must decide who stays and who is cast adrift to ensure the survival of the rest.",
      "awards": "None",
      "ratings": {
        "imdb": 7.4,
        "rotten_tomatoes_critic": 80,
        "rotten_tomatoes_popcorn": 75
      },
      "imdb_url": "https://www.imdb.com/title/tt0050962/"
    },
    {
      "title": "The Eddy Duchin Story",
      "year": 1956,
      "role": "Eddy Duchin",
      "role_description": "The famous pianist and bandleader whose professional success is contrasted with personal tragedies, including the death of his wife.",
      "plot": "A biopic of the popular 1930s pianist and bandleader Eddy Duchin, focusing on his career and his relationship with his son.",
      "awards": "Oscar: Nominated – Best Cinematography, Best Sound, Best Music, Best Story",
      "ratings": {
        "imdb": 6.8,
        "rotten_tomatoes_critic": 60,
        "rotten_tomatoes_popcorn": 68
      },
      "imdb_url": "https://www.imdb.com/title/tt0049173/"
    }
  ]
}